# Deleting Previous Records

In [ ]:
TRUNCATE TABLE employees;
TRUNCATE TABLE employees;

# Inserting Data for Original Table

In [ ]:

INSERT INTO employees (emp_id, first_name, last_name, dob, city, salary) VALUES
(12, 'Alice', 'Johnson', '1990-04-12', 'New York', 82000),
(13, 'Bob', 'Smith', '1985-09-23', 'Chicago', 75000),
(14, 'Carol', 'Davis', '1992-11-15', 'San Francisco', 91000),
(15, 'David', 'Miller', '1988-06-02', 'Houston', 68000),
(16, 'Emily', 'Brown', '1995-03-27', 'Seattle', 72000),
(17, 'Frank', 'Wilson', '1983-12-09', 'Boston', 99000),
(18, 'Grace', 'Taylor', '1991-07-19', 'Denver', 64000),
(19, 'Henry', 'Anderson', '1986-02-05', 'Miami', 78000),
(20, 'Ivy', 'Thomas', '1993-10-30', 'Austin', 70000),
(21, 'Jack', 'White', '1989-05-21', 'Los Angeles', 87000),
(22, 'Abigail', 'Black', '1990-04-12', 'New York', 82000),
(23, 'Bobby', 'Smith', '1985-09-23', 'Chicago', 75000);


SELECT * FROM employees;

# Truncate emp_cdc

In [ ]:
TRUNCATE TABLE emp_cdc;

# test insert

In [ ]:
INSERT INTO employees (emp_id, first_name, last_name, dob, city, salary)
VALUES (24, 'Liam', 'Walker', '1994-08-17', 'Dallas', 76000);

# test update

In [ ]:
UPDATE employees
SET salary = 79000, city = 'Austin'
WHERE emp_id = 24;

# test delete

In [ ]:
DELETE FROM employees
WHERE emp_id = 24;

# test batch insert

In [ ]:
INSERT INTO employees (emp_id, first_name, last_name, dob, city, salary)
VALUES
(25, 'Sophia', 'King', '1991-11-03', 'New York', 88000),
(26, 'Noah', 'Scott', '1996-07-09', 'Phoenix', 67000);